catalogue/mpi/pdq/spec/example-requests/InvokePatientDemographicsQuery.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
   <Header/>
   <Body>
      <InvokePatientDemographicsQuery xmlns="http://apps.wales.nhs.uk/mpi/">
            <QBP_Q21 xmlns="urn:hl7-org:v2xml">
                <MSH>
                    <MSH.1>|</MSH.1>
                    <MSH.2>^~\&amp;</MSH.2>
                    <MSH.3>
                        <HD.1>218</HD.1>
                    </MSH.3>
                    <MSH.4>
                        <HD.1>218</HD.1>
                    </MSH.4>
                    <MSH.5>
                        <HD.1>100</HD.1>
                    </MSH.5>
                    <MSH.6>
                        <HD.1>100</HD.1>
                    </MSH.6>
                    <MSH.7>
                        <TS.1>20180730144339</TS.1>
                    </MSH.7>
                    <MSH.9>
                        <MSG.1>QBP</MSG.1>
                        <MSG.2>Q22</MSG.2>
                        <MSG.3>QBP_Q21</MSG.3>
                    </MSH.9>
                    <MSH.10>9783</MSH.10>
                    <MSH.11>
                        <PT.1>T</PT.1>
                    </MSH.11>
                    <MSH.12>
                        <VID.1>2.5</VID.1>
                    </MSH.12>
                    <MSH.17>GBR</MSH.17>
                    <MSH.18>EN</MSH.18>
                </MSH>
                <QPD>
                    <QPD.1>
                        <CE.1>IHE PDQ Query</CE.1>
                    </QPD.1>
                    <QPD.2>PatientQuery</QPD.2>
                    <QPD.3>
                        <QIP.1>@PID.5.1</QIP.1>
                        <QIP.2>Holmes</QIP.2>
                    </QPD.3>
                    <QPD.3>
                        <QIP.1>@PID.5.2</QIP.1>
                        <QIP.2>Sherlock</QIP.2>
                    </QPD.3>
                    <QPD.3>
                        <QIP.1>@PID.7</QIP.1>
                        <QIP.2>19381108</QIP.2>
                    </QPD.3>
                </QPD>
                <RCP>
                    <RCP.1>I</RCP.1>
                </RCP>
            </QBP_Q21>
      </InvokePatientDemographicsQuery>
   </Body>
</Envelope>